street-canyon/fr-6-75/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            totalPressure;
        p0              uniform 0;
    }
    
    topWall
    {
	type            zeroGradient;
    }
    
    floorWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
	type            empty;
    }
    
    building
    {
	type            zeroGradient;
    }
    
}


// ************************************************************************* //
