street-canyon/fr-6-75/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       polynomial;
    thermo          hPolynomial;
    equationOfState rPolynomial;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.96;
    }
    thermodynamics
    {
        
        Hf              0; // heat of formation [J/kg]
        Sf              0; // entropy of formation [J/kg]
        CpCoeffs<5>     ( 1061.3 -4.3282e-1 1.0234e-3 -6.4747e-7 1.3864e-10 );
    }
    transport
    {
	muCoeffs<4>     ( 4.1130e-6 5.0523e-8 -1.4346e-11 2.5914e-15 );
	kappaCoeffs<6>  ( -7.488e-3 1.7082e-4 -2.3758e-7 2.2012e-10 9.46e-14 1.5797e-17 );
    }
    
    equationOfState
    {
    	C       (-7.77961e-3 2.89377e-3 0 0 0); //(-2.6884/345.57 1/345.57 0 0 0)
    }
}


// ************************************************************************* //
