street-canyon/fr-6-75/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (7.4 -0.2 0)
    (7.6 -0.2 0)
    (0 0 0)
    (7.4 0 0)
    (7.6 0 0)
    (8.88 0 0)
    (0 0.855 0)
    (7.4 0.855 0)
    (7.6 0.855 0)
    (8.88 0.855 0)
    (7.4 -0.2 0.1)
    (7.6 -0.2 0.1)
    (0 0 0.1)
    (7.4 0 0.1)
    (7.6 0 0.1)
    (8.88 0 0.1)
    (0 0.855 0.1)
    (7.4 0.855 0.1)
    (7.6 0.855 0.1)
    (8.88 0.855 0.1)        
);

blocks
(
    hex (0 1 4 3 10 11 14 13) (55 30 1) simpleGrading (1 15 1) // (50 10 1)
    hex (2 3 7 6 12 13 17 16) (100 30 1)  simpleGrading (1 10 1) // (222 52 1) 
    hex (3 4 8 7 13 14 18 17) (55 30 1) simpleGrading (1 10 1) // (50 52 1)
    hex (4 5 9 8 14 15 19 18) (17 30 1) simpleGrading (1 10 1) // (38 52 1) 
    
);

edges
(
);

boundary
(
	
    inlet
    {
        type patch;
        faces
        (
            (2 12 16 6)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (5 9 19 15)
        );
    }
    
    topWall
    {
        type wall;
        faces
        (
            (6 16 17 7)
            (7 17 18 8)
            (8 18 19 9)
        );
    }
    
    floorWall
    {
        type wall;
        faces
        (
            (2 3 13 12)
            (4 5 15 14)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (2 6 7 3)
            (3 7 8 4)
            (4 8 9 5)
            (10 11 14 13)
            (12 13 17 16)
            (13 14 18 17)
            (14 15 19 18)
            
        );
    }
       
    building
    {
        type wall;
        faces
        (
            (0 10 13 3)
            (0 1 11 10)
            (1 4 14 11)
        );
    }
);


// ************************************************************************* //
